app/View/Components/CategoryDropdown.php

    public function render()
    {
        return view('components.category-dropdown',[
            'categories' => Category::all(),
            'currentCategory' => Category::firstWhere('slug',request('category'))
        ]);
---
SELECT * FROM `categories`
SELECT * FROM `categories` WHERE `slug` = 'dolor-est-dicta-et-et-necessitatibus-voluptatum-quos' LIMIT 1