app/Http/Controllers/PostController.php

    public static function index()
    {
        return view('posts.index', [
            'posts' => Post::latest()
                ->filter(request(['search', 'category', 'author']))
                ->paginate(5)
                ->withQueryString(),
        ]);
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT * FROM `posts` ORDER BY `created_at` DESC
SELECT count(*) as aggregate FROM `posts`